GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.h
extern volatile IPR8bits_t IPR8bits __at(0x36F);
// bitfield macros
#define _IPR8_U2RXIP_POSN                                   0x0
#define _IPR8_U2RXIP_POSITION                               0x0
#define _IPR8_U2RXIP_SIZE                                   0x1
#define _IPR8_U2RXIP_LENGTH                                 0x1
#define _IPR8_U2RXIP_MASK                                   0x1
#define _IPR8_U2TXIP_POSN                                   0x1
#define _IPR8_U2TXIP_POSITION                               0x1
#define _IPR8_U2TXIP_SIZE                                   0x1
#define _IPR8_U2TXIP_LENGTH                                 0x1
#define _IPR8_U2TXIP_MASK                                   0x2
#define _IPR8_U2EIP_POSN                                    0x2
#define _IPR8_U2EIP_POSITION                                0x2
#define _IPR8_U2EIP_SIZE                                    0x1
#define _IPR8_U2EIP_LENGTH                                  0x1
#define _IPR8_U2EIP_MASK                                    0x4
#define _IPR8_U2IP_POSN                                     0x3
#define _IPR8_U2IP_POSITION                                 0x3
#define _IPR8_U2IP_SIZE                                     0x1
#define _IPR8_U2IP_LENGTH                                   0x1
#define _IPR8_U2IP_MASK                                     0x8
#define _IPR8_CLC4IP_POSN                                   0x5
#define _IPR8_CLC4IP_POSITION                               0x5
#define _IPR8_CLC4IP_SIZE                                   0x1
#define _IPR8_CLC4IP_LENGTH                                 0x1
#define _IPR8_CLC4IP_MASK                                   0x20
#define _IPR8_SCANIP_POSN                                   0x7
#define _IPR8_SCANIP_POSITION                               0x7
#define _IPR8_SCANIP_SIZE                                   0x1
#define _IPR8_SCANIP_LENGTH                                 0x1
#define _IPR8_SCANIP_MASK                                   0x80

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x370);
#ifndef _LIB_BUILD
asm("IPR9 equ 0370h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3RXIP                 :1;
        unsigned U3TXIP                 :1;
        unsigned U3EIP                  :1;
        unsigned U3IP                   :1;
        unsigned DMA3SCNTIP             :1;
        unsigned DMA3DCNTIP             :1;
        unsigned DMA3ORIP               :1;
        unsigned DMA3AIP                :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0x370);
// bitfield macros
#define _IPR9_U3RXIP_POSN                                   0x0
#define _IPR9_U3RXIP_POSITION                               0x0
#define _IPR9_U3RXIP_SIZE                                   0x1
#define _IPR9_U3RXIP_LENGTH                                 0x1
#define _IPR9_U3RXIP_MASK                                   0x1
#define _IPR9_U3TXIP_POSN                                   0x1
#define _IPR9_U3TXIP_POSITION                               0x1
#define _IPR9_U3TXIP_SIZE                                   0x1
#define _IPR9_U3TXIP_LENGTH                                 0x1
#define _IPR9_U3TXIP_MASK                                   0x2
#define _IPR9_U3EIP_POSN                                    0x2
#define _IPR9_U3EIP_POSITION                                0x2
#define _IPR9_U3EIP_SIZE                                    0x1
#define _IPR9_U3EIP_LENGTH                                  0x1
#define _IPR9_U3EIP_MASK                                    0x4
#define _IPR9_U3IP_POSN                                     0x3
#define _IPR9_U3IP_POSITION                                 0x3
#define _IPR9_U3IP_SIZE                                     0x1
#define _IPR9_U3IP_LENGTH                                   0x1
#define _IPR9_U3IP_MASK                                     0x8
#define _IPR9_DMA3SCNTIP_POSN                               0x4
#define _IPR9_DMA3SCNTIP_POSITION                           0x4
#define _IPR9_DMA3SCNTIP_SIZE                               0x1
#define _IPR9_DMA3SCNTIP_LENGTH                             0x1
#define _IPR9_DMA3SCNTIP_MASK                               0x10
#define _IPR9_DMA3DCNTIP_POSN                               0x5
#define _IPR9_DMA3DCNTIP_POSITION                           0x5
#define _IPR9_DMA3DCNTIP_SIZE                               0x1
#define _IPR9_DMA3DCNTIP_LENGTH                             0x1
#define _IPR9_DMA3DCNTIP_MASK                               0x20
#define _IPR9_DMA3ORIP_POSN                                 0x6
#define _IPR9_DMA3ORIP_POSITION                             0x6
#define _IPR9_DMA3ORIP_SIZE                                 0x1
#define _IPR9_DMA3ORIP_LENGTH                               0x1
#define _IPR9_DMA3ORIP_MASK                                 0x40
#define _IPR9_DMA3AIP_POSN                                  0x7
#define _IPR9_DMA3AIP_POSITION                              0x7
#define _IPR9_DMA3AIP_SIZE                                  0x1
#define _IPR9_DMA3AIP_LENGTH                                0x1
#define _IPR9_DMA3AIP_MASK                                  0x80

// Register: IPR10
#define IPR10 IPR10
extern volatile unsigned char           IPR10               __at(0x371);
#ifndef _LIB_BUILD
asm("IPR10 equ 0371h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IP                 :1;
        unsigned                        :2;
        unsigned TMR4IP                 :1;
        unsigned DMA4SCNTIP             :1;
        unsigned DMA4DCNTIP             :1;
        unsigned DMA4ORIP               :1;
        unsigned DMA4AIP                :1;
    };
} IPR10bits_t;
extern volatile IPR10bits_t IPR10bits __at(0x371);
// bitfield macros
#define _IPR10_INT2IP_POSN                                  0x0
#define _IPR10_INT2IP_POSITION                              0x0
#define _IPR10_INT2IP_SIZE                                  0x1
#define _IPR10_INT2IP_LENGTH                                0x1
#define _IPR10_INT2IP_MASK                                  0x1
#define _IPR10_TMR4IP_POSN                                  0x3
#define _IPR10_TMR4IP_POSITION                              0x3
#define _IPR10_TMR4IP_SIZE                                  0x1
#define _IPR10_TMR4IP_LENGTH                                0x1
#define _IPR10_TMR4IP_MASK                                  0x8
#define _IPR10_DMA4SCNTIP_POSN                              0x4
#define _IPR10_DMA4SCNTIP_POSITION                          0x4
#define _IPR10_DMA4SCNTIP_SIZE                              0x1
#define _IPR10_DMA4SCNTIP_LENGTH                            0x1
#define _IPR10_DMA4SCNTIP_MASK                              0x10
#define _IPR10_DMA4DCNTIP_POSN                              0x5
#define _IPR10_DMA4DCNTIP_POSITION                          0x5
#define _IPR10_DMA4DCNTIP_SIZE                              0x1
#define _IPR10_DMA4DCNTIP_LENGTH                            0x1
#define _IPR10_DMA4DCNTIP_MASK                              0x20
#define _IPR10_DMA4ORIP_POSN                                0x6
#define _IPR10_DMA4ORIP_POSITION                            0x6
#define _IPR10_DMA4ORIP_SIZE                                0x1
#define _IPR10_DMA4ORIP_LENGTH                              0x1
#define _IPR10_DMA4ORIP_MASK                                0x40
#define _IPR10_DMA4AIP_POSN                                 0x7
#define _IPR10_DMA4AIP_POSITION                             0x7
#define _IPR10_DMA4AIP_SIZE                                 0x1
#define _IPR10_DMA4AIP_LENGTH                               0x1
#define _IPR10_DMA4AIP_MASK                                 0x80

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
extern volatile unsigned char           STATUS_CSHAD        __at(0x373);
#ifndef _LIB_BUILD
asm("STATUS_CSHAD equ 0373h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_CSHADbits_t;
extern volatile STATUS_CSHADbits_t STATUS_CSHADbits __at(0x373);
// bitfield macros
#define _STATUS_CSHAD_NOT_PD_POSN                           0x5
#define _STATUS_CSHAD_NOT_PD_POSITION                       0x5
#define _STATUS_CSHAD_NOT_PD_SIZE                           0x1
#define _STATUS_CSHAD_NOT_PD_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_PD_MASK                           0x20
#define _STATUS_CSHAD_NOT_TO_POSN                           0x6
#define _STATUS_CSHAD_NOT_TO_POSITION                       0x6
#define _STATUS_CSHAD_NOT_TO_SIZE                           0x1
#define _STATUS_CSHAD_NOT_TO_LENGTH                         0x1
#define _STATUS_CSHAD_NOT_TO_MASK                           0x40
#define _STATUS_CSHAD_C_POSN                                0x0
#define _STATUS_CSHAD_C_POSITION                            0x0
#define _STATUS_CSHAD_C_SIZE                                0x1
#define _STATUS_CSHAD_C_LENGTH                              0x1
#define _STATUS_CSHAD_C_MASK                                0x1
#define _STATUS_CSHAD_DC_POSN                               0x1
#define _STATUS_CSHAD_DC_POSITION                           0x1
#define _STATUS_CSHAD_DC_SIZE                               0x1
#define _STATUS_CSHAD_DC_LENGTH                             0x1
#define _STATUS_CSHAD_DC_MASK                               0x2
#define _STATUS_CSHAD_Z_POSN                                0x2
#define _STATUS_CSHAD_Z_POSITION                            0x2
#define _STATUS_CSHAD_Z_SIZE                                0x1
#define _STATUS_CSHAD_Z_LENGTH                              0x1
#define _STATUS_CSHAD_Z_MASK                                0x4
#define _STATUS_CSHAD_OV_POSN                               0x3
#define _STATUS_CSHAD_OV_POSITION                           0x3
#define _STATUS_CSHAD_OV_SIZE                               0x1
#define _STATUS_CSHAD_OV_LENGTH                             0x1
#define _STATUS_CSHAD_OV_MASK                               0x8
#define _STATUS_CSHAD_N_POSN                                0x4
#define _STATUS_CSHAD_N_POSITION                            0x4
#define _STATUS_CSHAD_N_SIZE                                0x1
#define _STATUS_CSHAD_N_LENGTH                              0x1
#define _STATUS_CSHAD_N_MASK                                0x10
#define _STATUS_CSHAD_nPD_POSN                              0x5
#define _STATUS_CSHAD_nPD_POSITION                          0x5
#define _STATUS_CSHAD_nPD_SIZE                              0x1
#define _STATUS_CSHAD_nPD_LENGTH                            0x1
#define _STATUS_CSHAD_nPD_MASK                              0x20
#define _STATUS_CSHAD_nTO_POSN                              0x6
#define _STATUS_CSHAD_nTO_POSITION                          0x6
#define _STATUS_CSHAD_nTO_SIZE                              0x1
#define _STATUS_CSHAD_nTO_LENGTH                            0x1
#define _STATUS_CSHAD_nTO_MASK                              0x40
#define _STATUS_CSHAD_PD_POSN                               0x5
#define _STATUS_CSHAD_PD_POSITION                           0x5
#define _STATUS_CSHAD_PD_SIZE                               0x1
#define _STATUS_CSHAD_PD_LENGTH                             0x1
#define _STATUS_CSHAD_PD_MASK                               0x20
#define _STATUS_CSHAD_TO_POSN                               0x6
#define _STATUS_CSHAD_TO_POSITION                           0x6
#define _STATUS_CSHAD_TO_SIZE                               0x1
#define _STATUS_CSHAD_TO_LENGTH                             0x1
#define _STATUS_CSHAD_TO_MASK                               0x40

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
extern volatile unsigned char           WREG_CSHAD          __at(0x374);
#ifndef _LIB_BUILD
asm("WREG_CSHAD equ 0374h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_CSHADbits_t;
