GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x4FD);
#ifndef _LIB_BUILD
asm("TOSL equ 04FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x4FD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x4FE);
#ifndef _LIB_BUILD
asm("TOSH equ 04FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x4FE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x4FF);
#ifndef _LIB_BUILD
asm("TOSU equ 04FFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: CCPR1L
#define                                 CCPR1L_M1           0x4000
// Register: CCPR1H
#define                                 CCPR1H_M1           0x4001
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M1        0x4002
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M1        0x4003
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M1        0x4004
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M1        0x4005
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M1        0x4006
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M1        0x4007
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M2        0x400C
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M2        0x400D
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M1        0x400E
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M1        0x400F
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M2        0x4010
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M2        0x4011
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M1        0x4012
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M1        0x4013
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M2        0x4014
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M2        0x4015
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M1        0x4016
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M1        0x4017
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M3        0x401C
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M3        0x401D
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M2        0x401E
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M2        0x401F
// Register: PWM1PRL
#define                                 PWM1PRL_M1          0x4020
// Register: PWM1PRH
#define                                 PWM1PRH_M1          0x4021
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M3        0x4022
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M3        0x4023
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M2        0x4024
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M2        0x4025
// Register: PWM2PRL
#define                                 PWM2PRL_M1          0x4026
// Register: PWM2PRH
#define                                 PWM2PRH_M1          0x4027
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M3        0x4028
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M3        0x4029
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M2        0x402A
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M2        0x402B
// Register: PWM3PRL
#define                                 PWM3PRL_M1          0x402C
// Register: PWM3PRH
#define                                 PWM3PRH_M1          0x402D
// Register: CCPR1L
#define                                 CCPR1L_M2           0x403C
// Register: CCPR1H
#define                                 CCPR1H_M2           0x403D
// Register: T2PR
#define                                 T2PR_M1             0x403E
// Register: T4PR
#define                                 T4PR_M1             0x403F
// Register: ADLTHL
#define                                 ADLTHL_M1           0x4057
// Register: ADLTHH
#define                                 ADLTHH_M1           0x4058
// Register: ADUTHL
#define                                 ADUTHL_M1           0x4059
// Register: ADUTHH
#define                                 ADUTHH_M1           0x405A
// Register: ADERRL
#define                                 ADERRL_M1           0x405B
// Register: ADERRH
#define                                 ADERRH_M1           0x405C
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x405D
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x405E
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x405F
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x4060
// Register: ADACCL
#define                                 ADACCL_M1           0x4061
// Register: ADACCH
#define                                 ADACCH_M1           0x4062
// Register: ADACCU
#define                                 ADACCU_M1           0x4063
// Register: ADCNT
#define                                 ADCNT_M1            0x4064
// Register: ADRPT
#define                                 ADRPT_M1            0x4065
// Register: ADPREVL
#define                                 ADPREVL_M1          0x4066
// Register: ADPREVH
#define                                 ADPREVH_M1          0x4067
// Register: ADACQL
#define                                 ADACQL_M1           0x4068
// Register: ADACQH
#define                                 ADACQH_M1           0x4069
// Register: ADCAP
#define                                 ADCAP_M1            0x406A
// Register: ADCON0
#define                                 ADCON0_M1           0x406B
// Register: ADCON1
#define                                 ADCON1_M1           0x406C
// Register: ADCON2
#define                                 ADCON2_M1           0x406D
// Register: ADCON3
#define                                 ADCON3_M1           0x406E
// Register: ADREF
#define                                 ADREF_M1            0x406F
// Register: ADACT
#define                                 ADACT_M1            0x4070
// Register: ADCLK
#define                                 ADCLK_M1            0x4071
// Register: ADPCH
#define                                 ADPCH_M1            0x4072
// Register: ADRESL
#define                                 ADRESL_M1           0x4073
// Register: ADRESH
#define                                 ADRESH_M1           0x4074
// Register: ADLTHL
#define                                 ADLTHL_M2           0x40D7
// Register: ADLTHH
#define                                 ADLTHH_M2           0x40D8
// Register: ADUTHL
#define                                 ADUTHL_M2           0x40D9
// Register: ADUTHH
#define                                 ADUTHH_M2           0x40DA
// Register: ADERRL
#define                                 ADERRL_M2           0x40DB
// Register: ADERRH
#define                                 ADERRH_M2           0x40DC
// Register: ADSTPTL
#define                                 ADSTPTL_M2          0x40DD
// Register: ADSTPTH
#define                                 ADSTPTH_M2          0x40DE
// Register: ADFLTRL
#define                                 ADFLTRL_M2          0x40DF
// Register: ADFLTRH
#define                                 ADFLTRH_M2          0x40E0
// Register: ADACCL
#define                                 ADACCL_M2           0x40E1
// Register: ADACCH
#define                                 ADACCH_M2           0x40E2
// Register: ADACCU
#define                                 ADACCU_M2           0x40E3
// Register: ADCNT
#define                                 ADCNT_M2            0x40E4
// Register: ADRPT
#define                                 ADRPT_M2            0x40E5
// Register: ADPREVL
#define                                 ADPREVL_M2          0x40E6
// Register: ADPREVH
#define                                 ADPREVH_M2          0x40E7
// Register: ADACQL
#define                                 ADACQL_M2           0x40E8
// Register: ADACQH
#define                                 ADACQH_M2           0x40E9
// Register: ADCAP
#define                                 ADCAP_M2            0x40EA
// Register: ADPCH
#define                                 ADPCH_M2            0x40EB
// Register: ADRESL
#define                                 ADRESL_M2           0x40EC
// Register: ADRESH
#define                                 ADRESH_M2           0x40ED
// Register: DMAnBUF
#define                                 DMAnBUF_DMA1        0x4100
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA1      0x4101
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA1      0x4102
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA1      0x4103
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA1      0x4104
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA1       0x4105
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA1       0x4106
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA1       0x4107
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA1       0x4108
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA1      0x4109
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA1      0x410A
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA1      0x410B
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA1      0x410C
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA1      0x410D
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA1       0x410E
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA1       0x410F
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA1       0x4110
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA1       0x4111
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA1       0x4112
// Register: DMAnCON0
#define                                 DMAnCON0_DMA1       0x4113
// Register: DMAnCON1
#define                                 DMAnCON1_DMA1       0x4114
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA1       0x4115
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA1       0x4116
// Register: DMAnBUF
#define                                 DMAnBUF_DMA2        0x4117
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA2      0x4118
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA2      0x4119
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA2      0x411A
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA2      0x411B
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA2       0x411C
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA2       0x411D
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA2       0x411E
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA2       0x411F
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA2      0x4120
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA2      0x4121
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA2      0x4122
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA2      0x4123
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA2      0x4124
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA2       0x4125
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA2       0x4126
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA2       0x4127
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA2       0x4128
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA2       0x4129
// Register: DMAnCON0
#define                                 DMAnCON0_DMA2       0x412A
// Register: DMAnCON1
#define                                 DMAnCON1_DMA2       0x412B
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA2       0x412C
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA2       0x412D
// Register: DMAnBUF
#define                                 DMAnBUF_DMA3        0x412E
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA3      0x412F
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA3      0x4130
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA3      0x4131
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA3      0x4132
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA3       0x4133
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA3       0x4134
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA3       0x4135
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA3       0x4136
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA3      0x4137
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA3      0x4138
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA3      0x4139
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA3      0x413A
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA3      0x413B
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA3       0x413C
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA3       0x413D
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA3       0x413E
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA3       0x413F
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA3       0x4140
// Register: DMAnCON0
#define                                 DMAnCON0_DMA3       0x4141
// Register: DMAnCON1
#define                                 DMAnCON1_DMA3       0x4142
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA3       0x4143
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA3       0x4144
// Register: DMAnBUF
#define                                 DMAnBUF_DMA4        0x4145
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA4      0x4146
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA4      0x4147
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA4      0x4148
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA4      0x4149
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA4       0x414A
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA4       0x414B
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA4       0x414C
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA4       0x414D
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA4      0x414E
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA4      0x414F
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA4      0x4150
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA4      0x4151
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA4      0x4152
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA4       0x4153
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA4       0x4154
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA4       0x4155
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA4       0x4156
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA4       0x4157
// Register: DMAnCON0
#define                                 DMAnCON0_DMA4       0x4158
// Register: DMAnCON1
#define                                 DMAnCON1_DMA4       0x4159
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA4       0x415A
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA4       0x415B
// Register: IOCAF
#define                                 IOCAF_M1            0x41B2
// Register: IOCBF
#define                                 IOCBF_M1            0x41B3
// Register: IOCCF
#define                                 IOCCF_M1            0x41B4
// Register: TMR1L
#define                                 TMR1L_M1            0x41C7
// Register: TMR1H
#define                                 TMR1H_M1            0x41C8
// Register: TMR3L
#define                                 TMR3L_M1            0x41C9
// Register: TMR3H
#define                                 TMR3H_M1            0x41CA
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// I2C1CON2<ABD>
extern volatile __bit                   ABD                 __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 ABD_bit             _BIT_ACCESS(I2C1CON2,4)
// ADACCU<ACC20>
extern volatile __bit                   ACC20               __at(0x1F2C);	// @ (0x3E5 * 8 + 4)
#define                                 ACC20_bit           _BIT_ACCESS(ADACCU,4)
// ADACCU<ACC21>
extern volatile __bit                   ACC21               __at(0x1F2D);	// @ (0x3E5 * 8 + 5)
#define                                 ACC21_bit           _BIT_ACCESS(ADACCU,5)
// ADACCU<ACC22>
extern volatile __bit                   ACC22               __at(0x1F2E);	// @ (0x3E5 * 8 + 6)
#define                                 ACC22_bit           _BIT_ACCESS(ADACCU,6)
// ADACCU<ACC23>
extern volatile __bit                   ACC23               __at(0x1F2F);	// @ (0x3E5 * 8 + 7)
#define                                 ACC23_bit           _BIT_ACCESS(ADACCU,7)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x1AB4);	// @ (0x356 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// CRCCON0<ACCMOD>
extern volatile __bit                   ACCMOD              __at(0x1AB4);	// @ (0x356 * 8 + 4)
#define                                 ACCMOD_bit          _BIT_ACCESS(CRCCON0,4)
// I2C1CON1<ACKCNT>
extern volatile __bit                   ACKCNT              __at(0x14AF);	// @ (0x295 * 8 + 7)
#define                                 ACKCNT_bit          _BIT_ACCESS(I2C1CON1,7)
// I2C1CON1<ACKDT>
extern volatile __bit                   ACKDT               __at(0x14AE);	// @ (0x295 * 8 + 6)
#define                                 ACKDT_bit           _BIT_ACCESS(I2C1CON1,6)
// I2C1CON1<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x14AD);	// @ (0x295 * 8 + 5)
#define                                 ACKSTAT_bit         _BIT_ACCESS(I2C1CON1,5)
// I2C1CON1<ACKT>
extern volatile __bit                   ACKT                __at(0x14AC);	// @ (0x295 * 8 + 4)
#define                                 ACKT_bit            _BIT_ACCESS(I2C1CON1,4)
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0x14DE);	// @ (0x29B * 8 + 6)
#define                                 ACKT1IE_bit         _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 ACKT1IF_bit         _BIT_ACCESS(I2C1PIR,6)
// I2C1PIE<ACKTIE>
extern volatile __bit                   ACKTIE              __at(0x14DE);	// @ (0x29B * 8 + 6)
#define                                 ACKTIE_bit          _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKTIF>
extern volatile __bit                   ACKTIF              __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 ACKTIF_bit          _BIT_ACCESS(I2C1PIR,6)
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x1FAB);	// @ (0x3F5 * 8 + 3)
#define                                 ACLR_bit            _BIT_ACCESS(ADCON2,3)
// I2C1CON2<ACNT>
extern volatile __bit                   ACNT                __at(0x14B7);	// @ (0x296 * 8 + 7)
#define                                 ACNT_bit            _BIT_ACCESS(I2C1CON2,7)
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1F70);	// @ (0x3EE * 8 + 0)
#define                                 ACQ0_bit            _BIT_ACCESS(ADACQL,0)
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1F71);	// @ (0x3EE * 8 + 1)
#define                                 ACQ1_bit            _BIT_ACCESS(ADACQL,1)
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x1F7A);	// @ (0x3EF * 8 + 2)
#define                                 ACQ10_bit           _BIT_ACCESS(ADACQH,2)
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x1F7B);	// @ (0x3EF * 8 + 3)
#define                                 ACQ11_bit           _BIT_ACCESS(ADACQH,3)
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x1F7C);	// @ (0x3EF * 8 + 4)
#define                                 ACQ12_bit           _BIT_ACCESS(ADACQH,4)
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1F72);	// @ (0x3EE * 8 + 2)
#define                                 ACQ2_bit            _BIT_ACCESS(ADACQL,2)
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1F73);	// @ (0x3EE * 8 + 3)
#define                                 ACQ3_bit            _BIT_ACCESS(ADACQL,3)
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1F74);	// @ (0x3EE * 8 + 4)
#define                                 ACQ4_bit            _BIT_ACCESS(ADACQL,4)
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1F75);	// @ (0x3EE * 8 + 5)
